__Sales Predictor__

Raw Data

In [1]:
import pandas as pd
import numpy as np

In [23]:
df_stores = pd.read_csv("data/stores.csv")
df_oil = pd.read_csv("data/oil.csv")
df_txn = pd.read_csv("data/transactions.csv")
df_train = pd.read_csv("data/train.csv")
df_holidays = pd.read_csv("data\holidays_events.csv")

Dropping Transfered holidays

In [3]:
df_holidays = df_holidays[df_holidays["transferred"] != True]

In [4]:
df_holidays["transferred"].value_counts()

transferred
False    338
Name: count, dtype: int64

In [5]:
df_holidays.drop("transferred",axis=1,inplace=True)

In [6]:
df_holidays.head()

         date     type    locale locale_name                    description
0  2012-03-02  Holiday     Local       Manta             Fundacion de Manta
1  2012-04-01  Holiday  Regional    Cotopaxi  Provincializacion de Cotopaxi
2  2012-04-12  Holiday     Local      Cuenca            Fundacion de Cuenca
3  2012-04-14  Holiday     Local    Libertad      Cantonizacion de Libertad
4  2012-04-21  Holiday     Local    Riobamba      Cantonizacion de Riobamba

Dropping Description

In [7]:
df_holidays.drop("description",axis=1,inplace=True)
df_holidays.head()

         date     type    locale locale_name
0  2012-03-02  Holiday     Local       Manta
1  2012-04-01  Holiday  Regional    Cotopaxi
2  2012-04-12  Holiday     Local      Cuenca
3  2012-04-14  Holiday     Local    Libertad
4  2012-04-21  Holiday     Local    Riobamba

In [8]:
df_txn.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [13]:
df_oil.describe()

        dcoilwtico
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

Adding All dates in range and interpolating in oil data

In [24]:

df_oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [25]:
df_oil['date'] = pd.to_datetime(df_oil['date'])
df_oil.set_index('date',inplace=True)
df_oil = df_oil.reindex(pd.date_range(start=df_oil.index.min(), end=df_oil.index.max(), freq='D'))
df_oil['dcoilwtico'] = df_oil['dcoilwtico'].interpolate()

In [26]:
df_oil.head()

            dcoilwtico
2013-01-01         NaN
2013-01-02   93.140000
2013-01-03   92.970000
2013-01-04   93.120000
2013-01-05   93.146667

In [30]:
df_oil.isnull().sum()

dcoilwtico    1
dtype: int64

In [32]:
df_oil['dcoilwtico'] = df_oil['dcoilwtico'].interpolate(limit_direction='both')

In [33]:
df_oil.isnull().sum()

dcoilwtico    0
dtype: int64

In [34]:
df_oil.head()

            dcoilwtico
2013-01-01   93.140000
2013-01-02   93.140000
2013-01-03   92.970000
2013-01-04   93.120000
2013-01-05   93.146667

__EXIT__